Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes.SizeDefinitionMode Property
 Gets or sets the size definition mode.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SizeDefinitionMode SizeDefinitionMode { get; set; }
Public Property SizeDefinitionMode As SizeDefinitionMode
	Get
	Set
Property Value
Type: SizeDefinitionMode
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace